{
    "languageCode": "ru",

    "title": "GeoToSchemtic",

    "description": "Конвертируйте <b>KML и GeoJSON</b> файлы в <b>схематики Minecraft</b> с использованием проекции BuildTheEarth!",

    "status_import": "Загрузите файл",
    "status_converting": "Идет конвертация...",
    "status_success": "Успех! Используйте \"//paste -a -o\", чтобы правильно вставить схематику.",
    "status_error": "Ошибка во время чтения файла. Убедитесь, что ваш файл правильный",
    "status_error_toobig": "Погоди-ка, твой файл слишком большой для схематики! Как насчет разделить его на несколько файлов поменьше?",
    "status_error_wronglegacyid": "Неправильный ID блока. Используйте текстовый ID блока, который присутствует в 1.12.2",

    "basesettings": "🛠️ Основные настройки",
    "blockid": "ID блока контуров:",
    "offset": "↔️ Смещение",
    "offset_tooltip": "Дополнительное смещение схематики.<hr>В схематиках уже прописаны координаты в проекции BTE, на которые они вставляются командой //paste -o. Однако, на некоторых BTE серверах есть дополнительный сдвиг мира, обычно по Y. Именно этот и сдвиг и нужно прописать в этом разделе, он прибавится к координатам BTE. <span style=\"color:red\">На большинстве серверов нет сдвига мира, и вам здесь ничего менять не нужно.</span>",
    "offset_preset": "Предустановки смещения",
    "offset_preset1": "ASEAN offset",
    "offset_preset2": "Italy offset",
    "offset_preset3": "Romania offset",
    "offset_preset4": "BTE Balkans offset",
    "outputformat": "📤 Выходной формат",
    "spongeschematic": "Sponge schematic (1.13+)",
    "legacyschematic": "Legacy schematic (1.7-1.12.2)",

    "terrainsettings": "⛰️ Настройки рельефа",
    "conselevation": "Учитывать высоту",
    "conselevation_tooltip": "Расположить объекты на предполагаемых высотах в схематике, основываясь на их значениях высоты в исходном kml/geojson файле.<hr>Если отключено, то все объекты расположатся на высоте 0.",
    "fillterrain": "Заполнить рельеф",
    "fillterrain_tooltip": "Заполнить пустоты между контурными линиями в топографических схематиках, используя алгоритм scanline fill.<hr>Эта функция работает как с замкнутыми, так и с незамкнутыми контурами. Единственное требование - вертикальный интервал между контурными линиями 1 метр. Могут быть неправильно поставленные или пропущенные блоки, но их легко заметить и исправить.",
    "fillingblockid": "ID блока для заполнения:",
    
    "privacynotice": "Все файлы обрабатываются на вашем компьютере<br>и не загружаются на какой-либо сервер.",
    "sourcecode": "Исходный код",

    "error_wrongextension": "Поддерживаются только .kml и .geojson файлы",
    "error_wrongid": "Введите правильный ID блока. Поддерживаются только текстовые ID",
    "error_offset": "Введите правильные значения смещения. Значения смещения могут быть только целыми числами"
}